# описать функцию TrianglePS
# P = 3 * a; S = (a ** 2) * (3 ** 0.5) / 4
# найти периметры и площади  3-х равносторонних треугольников

try:
    def TrianglePS(a):  # функция
        P = 3 * a
        S = (a ** 2) * (3 ** 0.5) / 4
        return P, S  # возвращение


    a1 = 5
    a2 = 7
    a3 = 10

    P1, S1 = TrianglePS(a1)
    P2, S2 = TrianglePS(a2)
    P3, S3 = TrianglePS(a3)

    print(f"Периметр и площадь треугольника с стороной {a1}: P={P1}, S={S1}")
    print(f"Периметр и площадь треугольника с стороной {a2}: P={P2}, S={S2}")
    print(f"Периметр и площадь треугольника с стороной {a3}: P={P3}, S={S3}")

except ValueError:
    print("Ошибка")

